##AR   ##################################################################################
kilo141 = [['Kilo 141'], ['マズル ', 'フラッシュガード', 'タクティカルサプレッサー', 'ブリ―チャーデバイス', 'マズルブレーキ', 'ライトウェイトサプレッサー', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', 'シンガードアームズ16.6"SOCOM', 'シンガードアームズ19.8"Prowler', 'シンガードアームズ・ウィスパー'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'Glユニットミニリフレックスサイト', 'スカウトコンバットサイト', 'APX5ホログラフィックサイト', 'Cronen LP945ミニリフレックス', '4.0xフリップハイブリッド', 'VLK3.0xサイト', 'インテグラルハイブリッド', 'バイパーリフレックスサイト', 'Cronen C480 Proサイト', 'ソロゼロNVG改良版', 'モノクルリフレックスサイト', 'スナイパースコープ', 'マークサーマルサイト', 'PBXホロ7サイト', 'サーマル・ハイブリッド', 'Solozeroサイトミニリフレックス', '傾斜ハイブリッド', '可変ズームスコープ'], ['ストック ', 'FORGE TAC ウルトラライト', 'シンガードアームズ・インベーダー', 'ストックなし', 'FFS接近戦用ストック'], ['アンダーバレル ', 'コマンドフォアグリップ', 'M203 40mmコンカッション', 'マークフォアグリップ', 'M203 40mmスモークスクリーン', '12 Gauge Deputy', 'M203 40mmリーコン', 'M203 40mm高性能爆弾', 'M203 40mmフラッシュ', 'タクティカルフォアグリップ', 'M203 40mm焼夷弾', 'オペレーターフォアグリップ', 'レンジャーフォアグリップ', 'バイポッド'], ['弾薬 ', '50ラウンドマガジン', '60ラウンドマガジン', '100ラウンドドラムマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ラバーグリップテープ', 'ステッピング加工グリップテープ'], ['PERK ', 'FMJ', 'ヘビーヒッター', 'リーコン', 'フランジブル弾：傷害', '稼ぎ屋', 'フルロード', 'スライハンド', '高速近接', 'バースト', 'フランジブル弾：障害', '冷静沈着']]
fal = [['FAL'], ['マズル ', 'マズルブレーキ', 'フラッシュガード', 'タクティカルサプレッサー', 'ライトウェイトサプレッサー', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', '18.0"ウルトラライト', 'XRKマークスマン', '13.0"OSWパラ'], ['レーザー ', '5mWレーザー', '1mWレーザー', 'タックレーザー'], ['サイト ', 'Glユニットミニリフレックスサイト', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'スカウトコンバットサイト', 'APX5ホログラフィックサイト', '4.0xフリップハイブリッド', 'Solozeroサイトミニリフレックス', 'VLK3.0xサイト', 'オペレーターリフレックスサイト', 'スナイパースコープ', 'ソロゼロNVG改良版', 'インテグラルハイブリッド', 'バイパーリフレックスサイト', 'PBXホロ7サイト', 'モノクルリフレックスサイト', '傾斜ハイブリッド', '可変ズームスコープ', 'Cronen C480 Proサイト', 'Cronen LP945ミニリフレックス', 'マークサーマルサイト', 'サーマル・ハイブリッド'], ['ストック ', 'ファクトリー18"アルミニウムストック', 'ストックなし', 'FFS接近戦用ストック', 'FORGE TACストーカー'], ['アンダーバレル ', 'コマンドフォアグリップ', 'マークフォアグリップ', '12 Gauge Deputy', 'バイポッド', 'M203 40mmリーコン', 'M203 40mm高性能爆弾', 'レンジャーフォアグリップ', 'M203 40mmフラッシュ', 'M203 40mmスモークスクリーン', 'タクティカルフォアグリップ', 'M203 40mm焼夷弾', 'M203 40mmコンカッション', 'オペレーターフォアグリップ'], ['弾薬 ', '24ラウンドマガジン', '30ラウンドマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ステッピング加工グリップテープ', 'ラバーグリップテープ'], ['PERK ', 'ヘビーヒッター', 'リーコン', 'フランジブル弾：傷害', 'FMJ', 'スライハンド', '高速近接', 'フランジブル弾：障害', 'フルロード', 'バースト', '稼ぎ屋', '冷静沈着']]
m4a1 = [['M4A1'], ['マズル ', 'フラッシュガード', 'ブリ―チャーデバイス', 'タクティカルサプレッサー', 'マズルブレーキ', 'ライトウェイトサプレッサー', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', 'FFS 11.5"コマンド', 'ストックM16グレナディア', 'FFS 14.5"タックライト', 'コルバスカスタムマークスマン', 'FFS 12.4"プレデター'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'Cronen LP945ミニリフレックス', 'コープコンバットホロサイト', 'オペレーターリフレックスサイト', 'スカウトコンバットサイト', '4.0xフリップハイブリッド', 'エイムOPリフレックスサイト', 'APX5ホログラフィックサイト', 'インテグラルハイブリッド', 'ソロゼロNVG改良版', 'VLK3.0xサイト', 'スナイパースコープ', 'バイパーリフレックスサイト', 'Glユニットミニリフレックスサイト', 'PBXホロ7サイト', 'Cronen C480 Proサイト', 'モノクルリフレックスサイト', '可変ズームスコープ', '傾斜ハイブリッド', 'マークサーマルサイト', 'サーマル・ハイブリッド'], ['ストック ', 'M-16ストック', 'シンガードアームズ・インベーダー', 'ストックなし', 'FORGE TAC CQS'], ['アンダーバレル ', 'コマンドフォアグリップ', 'M203 40mm高性能爆弾', 'M203 40mm焼夷弾', '12 Gauge Deputy', 'マークフォアグリップ', 'M203 40mmスモークスクリーン', 'タクティカルフォアグリップ', 'M203 40mmリーコン', 'バイポッド', 'M203 40mmフラッシュ', 'レンジャーフォアグリップ', 'M203 40mmコンカッション', 'オペレーターフォアグリップ'], ['弾薬 ', '50ラウンドマガジン', '60ラウンドマガジン', '9mmパラベラム 32ラウンドマガジン', '.458 SOCOM 10ラウンドマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ラバーグリップテープ', 'ステッピング加工グリップテープ'], ['PERK ', 'FMJ', 'スライハンド', 'フランジブル弾：傷害', 'ヘビーヒッター', 'フルロード', 'バースト', 'リーコン', '稼ぎ屋', '高速近接', 'フランジブル弾：障害', '冷静沈着']]
fr556 = [['FR5.56'], ['マズル ', 'フラッシュガード', 'マズルブレーキ', 'タクティカルサプレッサー', 'コンペンセーター', 'ライトウェイトサプレッサー', 'モノリシックサプレッサー'], ['バレル ', 'FR 15.9"コマンド', 'FR 24.4"スナイパー', 'TAC FORGEウルトラライト'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'スカウトコンバットサイト', 'APX5ホログラフィックサイト', 'インテグラルハイブリッド', 'Solozeroサイトミニリフレックス', 'VLK3.0xサイト', '4.0xフリップハイブリッド', 'バイパーリフレックスサイト', 'PBXホロ7サイト', 'ソロゼロNVG改良版', 'スナイパースコープ', 'Cronen LP945ミニリフレックス', 'モノクルリフレックスサイト', 'Cronen C480 Proサイト', 'Glユニットミニリフレックスサイト', '可変ズームスコープ', 'サーマル・ハイブリッド', 'マークサーマルサイト', '傾斜ハイブリッド'], ['ストック ', 'FRウルトラライトくりぬき型', 'FORGE TACバラストパック', 'FFSタックラップ'], ['アンダーバレル ', 'コマンドフォアグリップ', 'M203 40mmスモークスクリーン', 'M203 40mm焼夷弾', 'マークフォアグリップ', 'M203 40mm高性能爆弾', 'M203 40mmコンカッション', 'タクティカルフォアグリップ', 'バイポッド', 'M203 40mmフラッシュ', '12 Gauge Deputy', 'オペレーターフォアグリップ', 'M203 40mmリーコン', 'レンジャーフォアグリップ'], ['弾薬 ', '50ラウンドマガジン', '60ラウンドマガジン'], ['リアグリップ ', 'ステッピング加工グリップテープ', '粒状グリップテープ', 'ラバーグリップテープ'], ['PERK ', 'リーコン', 'ヘビーヒッター', 'フランジブル弾：傷害', 'フルロード', '高速近接', '稼ぎ屋', 'FMJ', 'スライハンド', 'フランジブル弾：障害', '冷静沈着']]
oden = [['Oden'], ['マズル ', 'フラッシュガード', 'タクティカルサプレッサー', 'CQBブリ―チャーデバイス', 'コロッサスサプレッサー', 'コンペンセーター', 'マズルブレーキ', 'モノリシックサプレッサー'], ['バレル ', 'オーデンファクトリー810mm', 'オーデンファクトリー730mm', 'オーデンファクトリー420mm'], ['レーザー ', '5mWレーザー', '1mWレーザー', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'Solozeroサイトミニリフレックス', 'エイムOPリフレックスサイト', 'APX5ホログラフィックサイト', 'VLK3.0xサイト', 'バイパーリフレックスサイト', 'スナイパースコープ', 'ソロゼロNVG改良版', 'PBXホロ7サイト', 'モノクルリフレックスサイト', 'Glユニットミニリフレックスサイト', 'インテグラルハイブリッド', 'スカウトコンバットサイト', 'マークサーマルサイト', 'サーマル・ハイブリッド', 'Cronen C480 Proサイト', '傾斜ハイブリッド', '可変ズームスコープ', 'Cronen LP945ミニリフレックス'], ['ストック ', 'FORGE TACバラストパック', 'オーデンウルトラライトくりぬき型', 'FTAC XLエリートコーム'], ['アンダーバレル ', 'コマンドフォアグリップ', 'M203 40mmフラッシュ', 'マークフォアグリップ', 'M203 40mmコンカッション', 'M203 40mmスモークスクリーン', 'バイポッド', 'タクティカルフォアグリップ', 'レンジャーフォアグリップ', 'M203 40mm焼夷弾', 'M203 40mm高性能爆弾', '12 Gauge Deputy', 'M203 40mmリーコン', 'オペレーターフォアグリップ'], ['弾薬 ', '25ラウンドマガジン', '30ラウンドマガジン'], ['リアグリップ ', 'ステッピング加工グリップテープ', '粒状グリップテープ', 'ラバーグリップテープ'], ['PERK ', '高速近接', 'FMJ', 'リーコン', 'フランジブル弾：傷害', 'スライハンド', 'ヘビーヒッター', '稼ぎ屋', 'フランジブル弾：障害', 'フルロード', 'バーストファイア（x2）', '冷静沈着']]
m13 = [['M13'], ['マズル ', 'タクティカルサプレッサー', 'フラッシュガード', 'マズルブレーキ', 'ブリ―チャーデバイス', 'ライトウェイトサプレッサー', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', 'テンペス・ミニ', 'テンペス・サイクロン', 'テンペス・マークスマン'], ['レーザー ', '1mWレーザー', 'タックレーザー', '5mWレーザー'], ['サイト ', 'Solozeroサイトミニリフレックス', 'エイムOPリフレックスサイト', 'コープコンバットホロサイト', 'スカウトコンバットサイト', 'オペレーターリフレックスサイト', '4.0xフリップハイブリッド', 'APX5ホログラフィックサイト', 'インテグラルハイブリッド', 'Glユニットミニリフレックスサイト', 'VLK3.0xサイト', 'Cronen LP945ミニリフレックス', 'バイパーリフレックスサイト', 'スナイパースコープ', 'ソロゼロNVG改良版', 'モノクルリフレックスサイト', 'Cronen C480 Proサイト', 'マークサーマルサイト', '傾斜ハイブリッド', 'PBXホロ7サイト', 'サーマル・ハイブリッド', '可変ズームスコープ'], ['ストック ', 'FORGE TACストーカー', 'ストックなし', 'FFS接近戦用ストック', 'M13スケルトンストック'], ['アンダーバレル ', 'マークフォアグリップ', 'M203 40mmスモークスクリーン', 'コマンドフォアグリップ', 'M203 40mm焼夷弾', 'M203 40mmフラッシュ', 'バイポッド', 'M203 40mm高性能爆弾', 'タクティカルフォアグリップ', 'M203 40mmコンカッション', 'レンジャーフォアグリップ', 'M203 40mmリーコン', 'オペレーターフォアグリップ', '12 Gauge Deputy'], ['弾薬 ', '50ラウンドマガジン', '.300ブラックアウト 30ラウンドマガジン', '60ラウンドマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ステッピング加工グリップテープ', 'ラバーグリップテープ'], ['PERK ', 'ヘビーヒッター', 'フランジブル弾：傷害', 'フルロード', 'スライハンド', 'バースト', '稼ぎ屋', '高速近接', 'フランジブル弾：障害', 'リーコン', 'FMJ', '冷静沈着']]
fn_scar = [['FN SCAR 17'], ['マズル ', 'フラッシュガード', 'タクティカルサプレッサー', 'マズルブレーキ', 'ライトウェイトサプレッサー', 'ブリ―チャーデバイス', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', 'FORG TAC 17.2"LB', 'FORG TAC 20.0"LB', 'FORG TAC CQCプロ'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'Glユニットミニリフレックスサイト', '4.0xフリップハイブリッド', 'APX5ホログラフィックサイト', 'スカウトコンバットサイト', 'エイムOPリフレックスサイト', 'VLK3.0xサイト', 'サーマル・ハイブリッド', 'Solozeroサイトミニリフレックス', 'スナイパースコープ', 'バイパーリフレックスサイト', 'PBXホロ7サイト', 'Cronen C480 Proサイト', 'ソロゼロNVG改良版', 'モノクルリフレックスサイト', 'Cronen LP945ミニリフレックス', 'マークサーマルサイト', 'インテグラルハイブリッド', '可変ズームスコープ', '傾斜ハイブリッド'], ['ストック ', 'FTACハンター', 'FTACコラプシブルストック', 'FFS接近戦用ストック', 'XRKオベリスクプロ'], ['アンダーバレル ', 'コマンドフォアグリップ', 'M203 40mmコンカッション', 'マークフォアグリップ', 'M203 40mm高性能爆弾', 'M203 40mm焼夷弾', 'M203 40mmフラッシュ', 'タクティカルフォアグリップ', 'M203 40mmスモークスクリーン', '12 Gauge Deputy', 'バイポッドフォアグリップ', 'M203 40mmリーコン', 'オペレーターフォアグリップ'], ['弾薬 ', '25ラウンドマガジン', '30ラウンドマガジン'], ['リアグリップ ', 'ステッピング加工グリップテープ', '粒状グリップテープ', 'ラバーグリップテープ'], ['PERK ', '高速近接', 'フルロード', 'フランジブル弾：傷害', 'スライハンド', 'リーコン', '稼ぎ屋', 'ヘビーヒッター', 'フランジブル弾：障害', 'FMJ']]
ak47 = [['AK-47'], ['マズル ', 'フラッシュガード', 'マズルブレーキ', 'タクティカルサプレッサー', 'コンペンセーター', 'ライトウェイトサプレッサー', '銃剣', 'モノリシックサプレッサー'], ['バレル ', 'スペツナズ・エリート', '23.0"RPKバレル', '8.1"コンパクトバレル', '23.0"ロウメイニアン'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'スカウトコンバットサイト', 'APX5ホログラフィックサイト', 'Solozeroサイトミニリフレックス', 'インテグラルハイブリッド', 'VLK3.0xサイト', 'スナイパースコープ', 'バイパーリフレックスサイト', 'Glユニットミニリフレックスサイト', 'ソロゼロNVG改良版', 'モノクルリフレックスサイト', 'Cronen LP945ミニリフレックス', '傾斜ハイブリッド', 'Cronen C480 Proサイト', 'マークサーマルサイト', '可変ズームスコープ', 'サーマル・ハイブリッド'], ['ストック ', 'フィールドLMGストック', 'スケルトンストック', 'ストックなし', 'FFS接近戦用ストック', 'FORGE TAC ウルトラライト'], ['アンダーバレル ', 'バイポッド', 'コマンドフォアグリップ', 'GP25 40mm高性能爆弾', 'マークフォアグリップ', 'GP25 40mmスモークスクリーン', 'GP25 40mm焼夷弾', 'タクティカルフォアグリップ', 'GP25 40mmコンカッション', 'オペレーターフォアグリップ', 'レンジャーフォアグリップ', 'GP25 40mmフラッシュ', '12 Gauge Deputy', 'GP25 40mmリーコン'], ['弾薬 ', '40ラウンドマガジン', '5.45x39mm 30ラウンドマガジン', '75ラウンドマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ステッピング加工グリップテープ', 'ラバーグリップテープ'], ['PERK ', '高速近接', 'フルロード', 'フランジブル弾：傷害', 'スライハンド', 'リーコン', '稼ぎ屋', 'フランジブル弾：障害', 'ヘビーヒッター', 'FMJ', '冷静沈着']]
ram_7 = [['RAM-7'], ['マズル ', 'フラッシュガード', 'ブリ―チャーデバイス', 'タクティカルサプレッサー', 'マズルブレーキ', 'ライトウェイトサプレッサー', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', 'FTAC 13.5"コンパクト', 'FORGE TACイクリプス', 'XRK レンジャー'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'Cronen LP945ミニリフレックス', 'コープコンバットホロサイト', 'オペレーターリフレックスサイト', 'スカウトコンバットサイト', '4.0xフリップハイブリッド', 'エイムOPリフレックスサイト', 'APX5ホログラフィックサイト', 'インテグラルハイブリッド', 'Solozero NVG改良版', 'VLK3.0xサイト', 'スナイパースコープ', 'バイパーリフレックスサイト', 'Glユニットミニリフレックスサイト', 'PBXホロ7サイト', 'Cronen 2×2エリート', 'モノクルリフレックスサイト', '可変ズームスコープ', '傾斜ハイブリッド', 'Merc サーマルサイト', 'サーマル・ハイブリッド'], ['ストック ', 'FTACイクイリブリウム', 'XRK ウルトラライトくりぬき型', 'XRK 接近戦用ストック'], ['アンダーバレル ', 'コマンドフォアグリップ', 'M203 40mm高性能爆弾', 'M203 40mm焼夷弾', '12 Gauge Deputy', 'マークフォアグリップ', 'M203 40mmスモークスクリーン', 'タクティカルフォアグリップ', 'M203 40mmリーコン', 'M203 40mmフラッシュ', 'レンジャーフォアグリップ', 'M203 40mmコンカッション', 'オペレーターフォアグリップ'], ['弾薬 ', '45ラウンドマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ラバーグリップテープ', 'ステッピング加工グリップテープ'], ['PERK ', 'FMJ', 'スライハンド', 'フランジブル弾：傷害', 'ヘビーヒッター', 'フルロード', 'バースト', 'リーコン', '稼ぎ屋', '高速近接', 'フランジブル弾：障害', '冷静沈着']]
##SMG  #################################################################################
aug = [['AUG'], ['マズル ', 'CQBブリ―チャーデバイス', 'タクティカルサプレッサー', 'フラッシュガード', 'モノリシックサプレッサー', 'マズルブレーキ', 'コンペンセーター', 'ライトウェイトサプレッサー'], ['バレル ', '407mm拡張バレル', '407mmライトウェイト', '622mmロングバレル'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'Glユニットミニリフレックスサイト', 'スカウトコンバットサイト', 'APX5ホログラフィックサイト', 'Solozeroサイトミニリフレックス', 'VLK3.0xサイト', 'サーマル・ハイブリッド', 'バイパーリフレックスサイト', 'PBXホロ7サイト', 'ソロゼロNVG改良版', 'Cronen LP945ミニリフレックス', '4.0xフリップハイブリッド', 'モノクルリフレックスサイト', 'インテグラル3.0xサイト', 'Cronen C480 Proサイト', 'マークサーマルサイト', 'インテグラルハイブリッド'], ['ストック ', 'FTACウルトラライトくりぬき型', 'スケルトンストック', 'FFSヘビーストックプロ'], ['アンダーバレル ', 'マークフォアグリップ', 'コマンドフォアグリップ', 'タクティカルフォアグリップ', 'レンジャーフォアグリップ', 'オペレーターフォアグリップ'], ['弾薬 ', '32ラウンドマガジン', '5.56NATO 30ラウンドマガジン', '5.56NATO 60ラウンドマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ラバーグリップテープ', 'ステッピング加工グリップテープ'], ['PERK ', 'FMJ', 'ヘビーヒッター', 'リーコン', 'フランジブル弾：傷害', 'スライハンド', 'フルロード', '稼ぎ屋', 'フランジブル弾：障害', '高速近接', 'バースト']]
p90 = [['P90'], ['マズル ', 'フラッシュガード', 'マズルブレーキ', 'ブリ―チャーデバイス', 'ライトウェイトサプレッサー', 'モノリシックサプレッサー', 'コンペンセーター', 'タクティカルサプレッサー'], ['バレル ', 'FORGE TACリトリビューション', 'FSS 10.6"プロ'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'Solozeroサイトミニリフレックス', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'バイパーリフレックスサイト', 'Glユニットミニリフレックスサイト', 'スカウトコンバットサイト', 'APX5ホログラフィックサイト', 'Cronen LP945ミニリフレックス', 'FFSリングサイト', 'VLK3.0xサイト', 'ソロゼロNVG改良版', 'インテグラルハイブリッド', 'モノクルリフレックスサイト', 'PBXホロ7サイト', 'Cronen C480 Proサイト', '傾斜ハイブリッド', 'エイムOPリフレックスサイト', 'サーマル・ハイブリッド', 'マークサーマルサイト'], ['ストック ', 'FORGE TAC CQBコーム', 'フライトラップ', 'FFSヘビーストックプロ'], ['アンダーバレル ', '粒状グリップテープ', 'ステッピング加工グリップテープ', 'ラバーグリップテープ'], ['リアグリップ ', 'ステッピング加工グリップテープ', '粒状グリップテープ', 'ラバーグリップテープ'], ['PERK ', 'フランジブル弾：傷害', 'ヘビーヒッター', 'FMJ', 'フルロード', 'フランジブル弾：障害', '稼ぎ屋', 'スライハンド', 'リーコン', '高速近接']]
mp5 = [['MP5'], ['マズル ', 'フラッシュガード', 'タクティカルサプレッサー', 'マズルブレーキ', 'モノリシックサプレッサー', 'ライトウェイトサプレッサー', 'ブリ―チャーデバイス', 'コンペンセーター'], ['バレル ', 'FFSライト', 'モノシリック・インテグラルサプレッサー', 'FFSミニ', 'サブソニック・イテグラルサプレッサー'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'APX5ホログラフィックサイト', 'エイムOPリフレックスサイト', 'Solozeroサイトミニリフレックス', 'コープコンバットホロサイト', 'ソロゼロNVG改良版', 'スカウトコンバットサイト', 'Glユニットミニリフレックスサイト', 'VLK3.0xサイト', 'マークサーマルサイト', '傾斜ハイブリッド', 'Cronen LP945ミニリフレックス', 'PBXホロ7サイト', 'バイパーリフレックスサイト', 'Cronen C480 Proサイト', 'サーマル・ハイブリッド', 'インテグラルハイブリッド', 'モノクルリフレックスサイト'], ['ストック ', 'FORGE TAC ウルトラライト', 'クラシックストレートラインストック', 'FFS接近戦用ストック', 'FTACコラプシブル'], ['アンダーバレル ', 'コマンドフォアグリップ', 'マークフォアグリップ', 'レンジャーフォアグリップ', 'タクティカルフォアグリップ', 'オペレーターフォアグリップ'], ['弾薬 ', '45ラウンドマガジン', '10mmオート 30ラウンドマガジン'], ['リアグリップ ', 'ラバーグリップテープ', '粒状グリップテープ', 'ステッピング加工グリップテープ'], ['PERK ', 'フランジブル弾：傷害', '高速近接', 'リーコン', 'FMJ', '稼ぎ屋', 'スライハンド', 'フルロード', 'フランジブル弾：障害', 'バースト', 'ヘビーヒッター']]
uzi = [['UZI'], ['マズル ', 'フラッシュガード', 'マズルブレーキ', 'CQBブリ―チャーデバイス', 'タクティカルサプレッサー', 'モノリシックサプレッサー', 'ライトウェイトサプレッサー', 'コンペンセーター'], ['バレル ', '13.1"ファーストレスポンダー', '8.5"ファクトリー・ミニ', '16.5"ファクトリーカービン'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'Cronen LP945ミニリフレックス', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'バイパーリフレックスサイト', 'Solozeroサイトミニリフレックス', 'スカウトコンバットサイト', 'APX5ホログラフィックサイト', 'インテグラルハイブリッド', 'Glユニットミニリフレックスサイト', 'モノクルリフレックスサイト', 'VLK3.0xサイト', 'ソロゼロNVG改良版', '傾斜ハイブリッド', 'エイムOPリフレックスサイト', 'PBXホロ7サイト', 'サーマル・ハイブリッド', 'Cronen C480 Proサイト', 'マークサーマルサイト'], ['ストック ', 'FORGE TAC ウルトラライト', '標準ウッドストック', 'ストックなし', 'FFS接近戦用ストック'], ['アンダーバレル ', 'マークフォアグリップ', 'コマンドフォアグリップ', 'オペレーターフォアグリップ', 'タクティカルフォアグリップ', 'レンジャーフォアグリップ'], ['弾薬 ', '40ラウンドマガジン', '50ラウンドマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ステッピング加工グリップテープ', 'ラバーグリップテープ'], ['PERK ', 'ヘビーヒッター', 'フランジブル弾：傷害', 'リーコン', 'FMJ', 'フルロード', 'フランジブル弾：障害', 'スライハンド', '稼ぎ屋', '高速近接']]
pp19_bizon = [['PP19 BIZON'], ['マズル ', 'タクティカルサプレッサー', 'フラッシュガード', 'マズルブレーキ', 'ライトウェイトサプレッサー', 'CQBブリ―チャーデバイス', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', '8.7"ポリゴナル', '8.7"アルミニウム'], ['レーザー ', 'タックレーザー', '1mWレーザー', '5mWレーザー'], ['サイト ', 'モノクルリフレックスサイト', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'Cronen C480 Proサイト', 'Glユニットミニリフレックスサイト', 'APX5ホログラフィックサイト', 'オペレーターリフレックスサイト', 'ソロゼロNVG改良版', 'Solozeroサイトミニリフレックス', 'マークサーマルサイト', 'PBXホロ7サイト', 'サーマル・ハイブリッド', 'バイパーリフレックスサイト', 'Cronen LP945ミニリフレックス', 'スカウトコンバットサイト', 'インテグラルハイブリッド', '傾斜ハイブリッド', 'VLK3.0xサイト'], ['ストック ', 'ファクトリーアルミニウム', 'ストックなし', 'コルバススケルトンストック', 'FFS接近戦用ストック'], ['弾薬 ', '84ラウンドヘリカルマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ステッピング加工グリップテープ', 'ラバーグリップテープ'], ['PERK ', 'スライハンド', '高速近接', 'リーコン', 'FMJ', 'フランジブル弾：傷害', '稼ぎ屋', 'フランジブル弾：障害', 'ヘビーヒッター', 'フルロード']]
mp7 = [['MP7'], ['マズル ', 'フラッシュガード', 'タクティカルサプレッサー', 'マズルブレーキ', 'ブリ―チャーデバイス', 'ライトウェイトサプレッサー', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', 'FSSストライク', 'FSS RECON', 'FSS SWAT'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'エイムOPリフレックスサイト', 'コープコンバットホロサイト', 'オペレーターリフレックスサイト', 'Cronen LP945ミニリフレックス', 'VLK3.0xサイト', 'APX5ホログラフィックサイト', 'Glユニットミニリフレックスサイト', 'スカウトコンバットサイト', 'モノクルリフレックスサイト', 'ソロゼロNVG改良版', 'バイパーリフレックスサイト', 'PBXホロ7サイト', '4.0xフリップハイブリッド', 'Solozeroサイトミニリフレックス', 'マークサーマルサイト', 'Cronen C480 Proサイト', 'サーマル・ハイブリッド'], ['ストック ', 'FORGE TAC ウルトラライト', 'FORGE TACストーカー', 'FFS接近戦用ストック', 'ストックなし'], ['アンダーバレル ', 'コマンドフォアグリップ', 'マークフォアグリップ', 'タクティカルフォアグリップ', 'レンジャーフォアグリップ', 'オペレーターフォアグリップ'], ['弾薬 ', '50ラウンドマガジン', '60ラウンドマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ステッピング加工グリップテープ', 'ラバーグリップテープ'], ['PERK ', 'フランジブル弾：障害', '高速近接', 'リーコン', 'FMJ', 'フランジブル弾：傷害', '稼ぎ屋', 'フルロード', 'スライハンド', 'ヘビーヒッター']]
##SG   #################################################################################
model = [['MODEL680'], ['マズル ', 'ブリ―チャーデバイス', 'フラッシュガード', 'モノリシックサプレッサー', 'マズルブレーキ', 'コンペンセーター', 'チョーク', 'FSSマローダー', 'タクティカルサプレッサー'], ['バレル ', 'XRK 18.0"リベレーター', 'XRK 14.0"SWAT', 'XRK 30.0"スポート'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'Cronen LP945ミニリフレックス', 'APX5ホログラフィックサイト', 'スカウトコンバットサイト', 'バイパーリフレックスサイト', 'VLK3.0xサイト', 'Glユニットミニリフレックスサイト', 'ソロゼロNVG改良版', 'PBXホロ7サイト', 'モノクルリフレックスサイト', 'Cronen C480 Proサイト', 'Solozeroサイトミニリフレックス'], ['ストック ', 'FTACストーカー-12', 'FORGE TAC ウルトラライト', 'ストックなし', 'Lockwoodプレシジョンシリーズ', 'FTACハンター'], ['アンダーバレル ', 'コマンドフォアグリップ', 'マークフォアグリップ', 'タクティカルフォアグリップ', 'Lockwoodプレシジョンシリーズ', 'オペレーターフォアグリップ', 'XRKトゥルーグリップタクティカル'], ['弾薬 ', '拡張チューブ', 'スラグ弾'], ['PERK ', 'フランジブル弾：傷害', 'ヘビーヒッター', 'FMJ', 'スライハンド', 'リーコン', 'フルロード', '稼ぎ屋', '高速近接']]
r9_0_shotgun = [['R9-0 Shotgun'], ['マズル ', 'フラッシュガード', 'ブリ―チャーデバイス', 'タクティカルサプレッサー', 'マズルブレーキ', 'コンペンセーター', 'チョーク', 'ライトウェイトサプレッサー', 'モノリシックサプレッサー'], ['バレル ', 'FORGE TACセントリー', 'FORGE TACジェミニ'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'Cronen LP945ミニリフレックス', 'APX5ホログラフィックサイト', 'VLK3.0xサイト', 'バイパーリフレックスサイト', 'スカウトコンバットサイト', 'PBXホロ7サイト', 'Glユニットミニリフレックスサイト', 'モノクルリフレックスサイト', 'ソロゼロNVG改良版', 'Solozeroサイトミニリフレックス', 'Cronen C480 Proサイト'], ['ポンプ ', 'FSS R9-0ブルドッグ', 'FTACライトウェイトポンプ', 'FTACクローズコンバットプロ'], ['アンダーバレル ', 'マークフォアグリップ', 'レンジャーフォアグリップ', 'オペレーターフォアグリップ'], ['弾薬 ', '拡張チューブ', 'スラグ弾'], ['リアグリップ ', '粒状グリップテープ', 'ラバーグリップテープ', 'ステッピング加工グリップテープ'], ['PERK ', 'スライハンド', 'FMJ', 'フランジブル弾：傷害', 'ヘビーヒッター', 'フランジブル弾：障害', 'フルロード', '稼ぎ屋', 'リーコン', '高速近接']]
s725 = [['725'], ['マズル ', 'ブリ―チャーデバイス', 'フラッシュガード', 'ライトウェイトサプレッサー', 'マズルブレーキ', 'コンペンセーター', 'モノリシックサプレッサー', 'チョーク', 'タクティカルサプレッサー'], ['バレル ', 'テンペス・スムーズボア', 'ソードオフバレル', 'テンペス32"コンペティション'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'エイムOPリフレックスサイト', 'APX5ホログラフィックサイト', 'Cronen LP945ミニリフレックス', 'オペレーターリフレックスサイト', 'スカウトコンバットサイト', 'コープコンバットホロサイト', 'バイパーリフレックスサイト', 'Cronen C480 Proサイト', 'PBXホロ7サイト', 'Glユニットミニリフレックスサイト', 'VLK3.0xサイト', 'ソロゼロNVG改良版', 'モノクルリフレックスサイト', 'Brownlee 32mmスコープ', 'Solozeroサイトミニリフレックス'], ['ストック ', 'Chronenエルゴプレシジョン', 'Chronenプロライト', 'ソードオフストック', 'テンペス・スポーツ'], ['アンダーバレル ', 'コマンドフォアグリップ', 'マークフォアグリップ', 'タクティカルフォアグリップ', 'レンジャーフォアグリップ', 'オペレーターフォアグリップ'], ['弾薬 ', 'スラグ弾'], ['ガード ', 'テンペス・スリムグリップ', 'FORGE TACステディグリップ', 'FORGE TACコマンダー'], ['PERK ', 'ヘビーヒッター', 'FMJ', 'フルロード', '稼ぎ屋', 'スライハンド', 'フランジブル弾：傷害', '高速近接', 'リーコン', 'フランジブル弾：障害']]
origin = [['Origin 12 Shotgun'], ['マズル ', 'ブリ―チャーデバイス', 'フラッシュガード', 'タクティカルサプレッサー', 'マズルブレーキ', 'コンペンセーター', 'チョーク', 'ライトウェイトサプレッサー'], ['バレル ', 'FORGE TACプレシジョン', 'FORGE TACワイドショット', 'FORGE TACインペーラー'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'Solozeroサイトミニリフレックス', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'Cronen LP945ミニリフレックス', 'オペレーターリフレックスサイト', 'スカウトコンバットサイト', 'PBXホロ7サイト', 'VLK3.0xサイト', 'バイパーリフレックスサイト', 'APX5ホログラフィックサイト', 'Glユニットミニリフレックスサイト', 'Cronen C480 Proサイト', 'モノクルリフレックスサイト', 'ソロゼロNVG改良版'], ['ストック ', 'FTACハンター', 'FORGE TAC ウルトラライト', 'ストックなし', 'FORGE TACダート'], ['アンダーバレル ', 'マークフォアグリップ', 'コマンドフォアグリップ'], ['弾薬 ', '12ラウンドマガジン', '8ラウンドスラグマガジン', '25ラウンドドラムマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ラバーグリップテープ', 'ステッピング加工グリップテープ'], ['PERK ', 'フランジブル弾：障害', 'FMJ', 'フランジブル弾：傷害', 'リーコン', '高速近接', 'ヘビーヒッター', 'スライハンド', '稼ぎ屋', 'フルロード']]
##lmg ####################################################################################
pkm = [['PKM'], ['マズル ', 'フラッシュガード', 'モノリシックサプレッサー', 'マズルブレーキ', 'CQBブリ―チャーデバイス', 'ライトウェイトサプレッサー', 'コンペンセーター', 'タクティカルサプレッサー'], ['バレル ', '18.2"コンパクトバレル', '26.9"拡張バレル', '25.9"ヘビーバレル'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'VLK3.0xサイト', 'Solozeroサイトミニリフレックス', 'PBXホロ7サイト', 'Cronen LP945ミニリフレックス', 'インテグラルハイブリッド', 'ソロゼロNVG改良版', 'スカウトコンバットサイト', 'モノクルリフレックスサイト', 'スナイパースコープ', 'APX5ホログラフィックサイト', 'Glユニットミニリフレックスサイト', 'Cronen C480 Proサイト', 'マークサーマルサイト', '傾斜ハイブリッド', 'バイパーリフレックスサイト', 'サーマル・ハイブリッド'], ['ストック ', 'FORGE TACストーカー', 'FORGE TAC ウルトラライト', 'FFS接近戦用ストック', 'ストックなし'], ['アンダーバレル ', 'コマンドフォアグリップ', 'マークフォアグリップ', 'タクティカルフォアグリップ', 'バイポッド', 'スナッチグリップ', 'オペレーターフォアグリップ'], ['弾薬 ', '150ラウンドベルト', '200ラウンドベルト'], ['リアグリップ ', 'ステッピング加工グリップテープ', 'ラバーグリップテープ', '粒状グリップテープ'], ['PERK ', 'ヘビーヒッター', 'リーコン', 'フランジブル弾：傷害', '高速近接', '稼ぎ屋', 'フルロード', 'スライハンド', 'FMJ', 'フランジブル弾：障害']]
sa87 = [['SA87'], ['マズル ', 'フラッシュガード', 'タクティカルサプレッサー', 'マズルブレーキ', 'CQBブリ―チャーデバイス', 'ライトウェイトサプレッサー', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', 'SA87 18.2"ファクトリー', 'SA87 25.4"ファクトリー', 'SA87 12.4"ファクトリー'], ['レーザー ', '5mWレーザー', '1mWレーザー', 'タックレーザー'], ['サイト ', 'Glユニットミニリフレックスサイト', 'コープコンバットホロサイト', 'オペレーターリフレックスサイト', 'バイパーリフレックスサイト', 'スカウトコンバットサイト', 'APX5ホログラフィックサイト', 'Solozeroサイトミニリフレックス', 'ソロゼロNVG改良版', 'インテグラルハイブリッド', 'VLK3.0xサイト', 'エイムOPリフレックスサイト', 'Cronen LP945ミニリフレックス', 'スナイパースコープ', 'マークサーマルサイト', 'PBXホロ7サイト', 'Cronen C480 Proサイト', 'サーマル・ハイブリッド', 'モノクルリフレックスサイト', '傾斜ハイブリッド'], ['ストック ', 'FFS SA87ヘビーストックプロ', 'SA87ウルトラライトくりぬき型', 'FORGE TAC CQBコーム'], ['アンダーバレル ', 'コマンドフォアグリップ', 'マークフォアグリップ', 'タクティカルフォアグリップ', 'オペレーターフォアグリップ', 'バイポッド', 'レンジャーフォアグリップ'], ['弾薬 ', '50ラウンドマガジン', '60ラウンドマガジン'], ['リアグリップ ', 'ラバーグリップテープ', '粒状グリップテープ', 'ステッピング加工グリップテープ'], ['PERK ', 'ヘビーヒッター', 'リーコン', 'フランジブル弾：傷害', 'スライハンド', '稼ぎ屋', '高速近接', 'FMJ', 'フルロード', 'フランジブル弾：障害']]
m91 = [['M91'], ['マズル ', 'ブリ―チャーデバイス', 'フラッシュガード', 'マズルブレーキ', 'ライトウェイトサプレッサー', 'タクティカルサプレッサー', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', 'M91スペシャルフォース', 'M91インファントリー', 'M91ヘビー'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'Cronen LP945ミニリフレックス', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'バイパーリフレックスサイト', 'VLK3.0xサイト', 'APX5ホログラフィックサイト', 'オペレーターリフレックスサイト', 'ソロゼロNVG改良版', 'インテグラルハイブリッド', 'スカウトコンバットサイト', 'Solozeroサイトミニリフレックス', 'スナイパースコープ', '4.0xフリップハイブリッド', 'マークサーマルサイト', 'Glユニットミニリフレックスサイト', 'PBXホロ7サイト', '傾斜ハイブリッド', 'モノクルリフレックスサイト', 'Cronen C480 Proサイト', 'サーマル・ハイブリッド'], ['ストック ', 'FORGE TACストーカー', 'FORGE TAC ウルトラライト', 'ストックなし', 'XRKストライカー'], ['アンダーバレル ', 'コマンドフォアグリップ', 'マークフォアグリップ', 'バイポッド', 'タクティカルフォアグリップ', 'レンジャーフォアグリップ', 'オペレーターフォアグリップ'], ['弾薬 ', '120ラウンドベルト', '150ラウンドベルト'], ['リアグリップ ', '粒状グリップテープ', 'ステッピング加工グリップテープ', 'ラバーグリップテープ'], ['PERK ', 'ヘビーヒッター', 'リーコン', 'FMJ', 'スライハンド', 'フランジブル弾：傷害', '高速近接', 'フルロード', '稼ぎ屋', 'フランジブル弾：障害']]
mg34 = [['MG34'], ['マズル ', 'CQBブリ―チャーデバイス', 'フラッシュガード', 'マズルブレーキ', 'ライトウェイトサプレッサー', 'タクティカルサプレッサー', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', 'FSSブルート', 'FSSスタビ―', 'FSSエリート'], ['レーザー ', 'タックレーザー', '5mWレーザー', '1mWレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'Glユニットミニリフレックスサイト', 'スカウトコンバットサイト', 'APX5ホログラフィックサイト', 'Cronen LP945ミニリフレックス', 'インテグラルハイブリッド', 'ソロゼロNVG改良版', 'VLK3.0xサイト', 'バイパーリフレックスサイト', 'マークサーマルサイト', 'サーマル・ハイブリッド', 'Cronen C480 Proサイト', 'モノクルリフレックスサイト', '傾斜ハイブリッド', 'PBXホロ7サイト', 'Solozeroサイトミニリフレックス', 'スナイパースコープ'], ['ストック ', 'FORGE TACストーカー', 'FORGE TAC ウルトラライト', 'ストックなし', 'FFS接近戦用ストック'], ['アンダーバレル ', 'マークフォアグリップ', 'バイポッド', 'コマンドフォアグリップ', 'タクティカルフォアグリップ', 'オペレーターフォアグリップ', 'レンジャーフォアグリップ'], ['弾薬 ', '75ラウンドベルト', '100ラウンドベルト'], ['リアグリップ ', 'ステッピング加工グリップテープ', '粒状グリップテープ', 'ラバーグリップテープ'], ['PERK ', 'ヘビーヒッター', 'リーコン', '高速近接', 'フランジブル弾：障害', 'FMJ', 'スライハンド', '稼ぎ屋', 'フルロード', 'フランジブル弾：傷害']]
holger = [['Holger-26'], ['マズル ', 'ブリ―チャーデバイス', 'フラッシュガード', 'マズルブレーキ', 'ライトウェイトサプレッサー', 'タクティカルサプレッサー', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', 'XRKウルトラライト', 'FTAC 8.98"スプリットファイア'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'Cronen LP945ミニリフレックス', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'バイパーリフレックスサイト', 'VLK3.0xサイト', 'APX5ホログラフィックサイト', 'オペレーターリフレックスサイト', 'Solozero NVG改良版', 'インテグラルハイブリッド', 'スカウトコンバットサイト', 'Solozeroサイトミニリフレックス', 'インテグラルハイブリッド', 'スナイパースコープ', '4.0xフリップハイブリッド', 'Merc サーマルサイト', 'Glユニットミニリフレックスサイト', 'PBXホロ7サイト', '傾斜ハイブリッド', 'モノクルリフレックスサイト', 'Cronen C480 Proサイト', 'サーマル・ハイブリッド', 'Solozero K498 4.0xインテグラル'], ['ストック ', 'FFSレンジャー', 'FFSインファントリー', 'ストックなし', 'XRK Axis'], ['アンダーバレル ', 'コマンドフォアグリップ', 'マークフォアグリップ', 'タクティカルフォアグリップ', 'レンジャーフォアグリップ', 'オペレーターフォアグリップ'], ['弾薬 ', '30ラウンドマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ステッピング加工グリップテープ', 'ラバーグリップテープ'], ['PERK ', 'ヘビーヒッター', 'リーコン', 'FMJ', 'スライハンド', 'フランジブル弾：傷害', '高速近接', 'フルロード', '稼ぎ屋', 'フランジブル弾：障害']]
##mr #####################################################################################
ebr = [['EBR-14'], ['マズル ', 'フラッシュガード', 'タクティカルサプレッサー', 'ブリ―チャーデバイス', 'マズルブレーキ', 'コンペンセーター', 'ライトウェイトサプレッサー', 'モノリシックサプレッサー'], ['バレル ', 'FORGE TACプレシジョン20.0"', 'FORGE TACエリート', 'FORGE TACプレシジョン22.0"'], ['レーザー ', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'スカウトコンバットサイト', 'APX5ホログラフィックサイト', 'インテグラルハイブリッド', 'Glユニットミニリフレックスサイト', 'VLK3.0xサイト', 'PBXホロ7サイト', 'ソロゼロNVG改良版', 'スナイパースコープ', '4.0xフリップハイブリッド', 'バイパーリフレックスサイト', '傾斜ハイブリッド', 'モノクルリフレックスサイト', '可変ズームスコープ', 'Cronen C480 Proサイト', 'マークサーマルサイト', 'サーマル・ハイブリッド'], ['ストック ', 'FTACプレシジョンコーム', 'FFSレイダーシャーシプロ', 'FTACライトウェイトストック', 'FFSレイダーシャーシエリート'], ['アンダーバレル ', 'コマンドフォアグリップ', 'タクティカルフォアグリップ', 'バイポッド', 'マークフォアグリップ', 'レンジャーフォアグリップ', 'オペレーターフォアグリップ'], ['弾薬 ', '15ラウンドベルト', '20ラウンドベルト'], ['PERK ', 'ヘビーヒッター', 'FMJ', '高速近接', 'スライハンド', 'フランジブル弾：障害', 'フルロード', '稼ぎ屋', '冷静沈着', 'リーコン', 'フォーカス', 'フランジブル弾：傷害']]
mk2 = [['MK2 CARBINE'], ['マズル ', 'フラッシュガード', 'タクティカルサプレッサー', 'マズルブレーキ', 'コンペンセーター', 'ライトウェイトサプレッサー', 'ブリ―チャーデバイス', 'モノリシックサプレッサー'], ['バレル ', 'FSS18.0"ファクトリー', 'FSS20.0"ファクトリー', 'FSS24.0"ファクトリー'], ['レーザー ', 'タックレーザー'], ['サイト ', 'Cronen LP945ミニリフレックス', 'コープコンバットホロサイト', 'バイパーリフレックスサイト', 'PBXホロ7サイト', 'Cronen C480 Proサイト', 'Solozeroサイトミニリフレックス', 'オペレーターリフレックスサイト', 'VLK3.0xサイト', 'ソロゼロNVG改良版', 'スナイパースコープ', '4.0xフリップハイブリッド', 'Glユニットミニリフレックスサイト', 'エイムOPリフレックスサイト', 'APX5ホログラフィックサイト', 'モノクルリフレックスサイト', 'サーマル・ハイブリッド', 'スカウトコンバットサイト', 'マークサーマルサイト', 'インテグラルハイブリッド', '可変ズームスコープ'], ['ストック ', 'カートリッジスリーブ', 'FFS MK2スポーツコーム', 'FFSMK2プレシジョンコーム', 'MK2ウルトラライトくりぬき型'], ['リアグリップ ', 'ラバーグリップテープ', 'ステッピング加工グリップテープ', '粒状グリップテープ'], ['PERK ', 'ヘビーヒッター', 'FMJ', 'スライハンド', 'フランジブル弾：傷害', 'フルロード', 'フォーカス', '冷静沈着', '稼ぎ屋', '高速近接', 'リーコン', 'フランジブル弾：障害']]
kar98k = [['Kar98K'], ['マズル ', 'フラッシュガード', 'ブリ―チャーデバイス', 'マズルブレーキ', 'タクティカルサプレッサー', 'モノリシックサプレッサー', 'コンペンセーター', 'ライトウェイトサプレッサー'], ['バレル ', 'シンガードカスタム25.1"', 'シンガードカスタム21.2"', 'シンガードカスタム27.6"'], ['レーザー ', 'タックレーザー'], ['サイト ', 'Cronen LP945ミニリフレックス', 'エイムOPリフレックスサイト', 'コープコンバットホロサイト', 'スカウトコンバットサイト', 'APX5ホログラフィックサイト', 'オペレーターリフレックスサイト', '4.0xフリップハイブリッド', 'スナイパースコープ', 'インテグラルハイブリッド', 'ソロゼロNVG改良版', 'VLK3.0xサイト', 'PBXホロ7サイト', 'Glユニットミニリフレックスサイト', 'バイパーリフレックスサイト', 'Cronen C480 Proサイト', 'Solozeroサイトミニリフレックス', 'モノクルリフレックスサイト', 'マークサーマルサイト', 'サーマル・ハイブリッド', '可変ズームスコープ'], ['ストック ', 'STVOLプレシジョンコーム', 'くりぬき型ストックMOD', 'FTACスポーツコーム'], ['アンダーバレル ', 'バイポッド'], ['リアグリップ ', 'ステッピング加工グリップテープ', '粒状グリップテープ', 'ラバーグリップテープ'], ['PERK ', 'ヘビーヒッター', 'FMJ', 'スライハンド', 'フランジブル弾：傷害', 'フルロード', '冷静沈着', '稼ぎ屋', 'フォーカス', '高速近接', 'リーコン', 'フランジブル弾：障害']]
##sr ################################################################################
dragunov = [['Dragunov'], ['マズル ', 'フラッシュガード', 'モノリシックサプレッサー', 'ブリ―チャーデバイス', 'マズルブレーキ', 'タクティカルサプレッサー', 'コンペンセーター', 'ライトウェイトサプレッサー'], ['バレル ', '510mmコンパクトバレル', '660mm拡張バレル'], ['レーザー ', 'タックレーザー'], ['サイト ', 'スカウトコンバットサイト', 'サーマルスナイパースコープ', 'VLK3.0xサイト', '可変ズームスコープ', 'サーマルデュアルパワースコープ', 'Cronen C480 Proサイト', 'マークサーマルサイト'], ['ストック ', 'FTACハンタースカウト', 'スケルトンストック', 'VLKライトウェイトストック', 'FTACストーカー-スカウト'], ['アンダーバレル ', 'バイポッド'], ['弾薬 ', '15ラウンドマガジン', '20ラウンドマガジン'], ['PERK ', 'ヘビーヒッター', 'リーコン', 'スライハンド', 'フルロード', 'フランジブル弾：傷害', '冷静沈着', '稼ぎ屋', '高速近接', 'FMJ', 'フォーカス', 'フランジブル弾：障害']]
hdr = [['HDR'], ['マズル ', 'フラッシュガード', 'タクティカルサプレッサー', 'ブリ―チャーデバイス', 'マズルブレーキ', 'ライトウェイトサプレッサー', 'コンペンセーター', 'モノリシックサプレッサー'], ['バレル ', '26.9"HDRプロ', '26.9"ブルバレル', '17.2"ブルバレル'], ['レーザー ', 'タックレーザー'], ['サイト ', 'スカウトコンバットサイト', 'サーマルスナイパースコープ', 'VLK3.0xサイト', '可変ズームスコープ', 'Cronen C480 Proサイト', 'マークサーマルサイト', 'サーマルデュアルパワースコープ'], ['ストック ', 'FTACストーカー-スカウト', 'FTACハンタースカウト', 'FSSノーマッドストック', 'FTACチャンピオン'], ['アンダーバレル ', 'バイポッド'], ['弾薬 ', '7ラウンドマガジン', '9ラウンドマガジン'], ['PERK ', 'ヘビーヒッター', 'FMJ', 'リーコン', 'スライハンド', 'フランジブル弾：障害', 'フルロード', 'フォーカス', '冷静沈着', '稼ぎ屋', '高速近接', 'フランジブル弾：傷害']]
ax_50 = [['AX-50'], ['マズル ', 'フラッシュガード', 'ライトウェイトサプレッサー', 'ブリ―チャーデバイス', 'マズルブレーキ', 'モノリシックサプレッサー', 'コンペンセーター', 'タクティカルサプレッサー'], ['バレル ', 'シンガードアームズ・プロ', '17.0"ファクトリーバレル', '32.0"ファクトリーバレル'], ['レーザー ', 'タックレーザー'], ['サイト ', 'スカウトコンバットサイト', 'VLK3.0xサイト', 'サーマルスナイパースコープ', '可変ズームスコープ', 'Cronen C480 Proサイト', 'マークサーマルサイト', 'サーマルデュアルパワースコープ'], ['ストック ', 'シンガードアームズ・マークスマン', 'シンガードアームズ・イベーダー', 'シンガードアームズ・アサシン'], ['アンダーバレル ', 'バイポッド'], ['弾薬 ', '7ラウンドマガジン'], ['リアグリップ ', 'ステッピング加工グリップテープ', '粒状グリップテープ', 'ラバーグリップテープ'], ['PERK ', 'ヘビーヒッター', 'スライハンド', '高速近接', 'リーコン', '冷静沈着', 'フォーカス', '稼ぎ屋', 'フランジブル弾：傷害', 'FMJ', 'フルロード', 'フランジブル弾：障害']]
##hg  ################################################################################
x16 = [['X16'], ['マズル ', 'フラッシュガード', 'モノリシックサプレッサー', 'マズルブレーキ', 'オイル缶サプレッサー', 'コンペンセーター', 'ライトウェイトサプレッサー', 'タクティカルサプレッサー'], ['バレル ', 'シンガードアームズ・フェザーウェイト', 'バンガード・エリート', 'シンガードアームズ・アドバンテージ'], ['レーザー ', '1mWレーザー', 'タックレーザー', '5mWレーザー'], ['サイト ', 'Solozeroサイトミニリフレックス', 'Glユニットミニリフレックスサイト', 'Cronen LP945ミニリフレックス'], ['トリガーアクション ', '軽量トリガー', '耐久トリガー', 'マッチグレードトリガー'], ['弾薬 ', '17ラウンドマガジン', '26ラウンドマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ステッピング加工グリップテープ', 'X16ストック', 'ラバーグリップテープ'], ['PERK ', '高速近接', 'フランジブル弾：傷害', 'フランジブル弾：障害', 'FMJ', '稼ぎ屋', 'スライハンド', 'リーコン', 'ヘビーヒッター', 'フルロード']]
h1911 = [['1911'], ['マズル ', 'フラッシュガード', 'オイル缶サプレッサー', 'マズルブレーキ', 'タクティカルサプレッサー', 'コンペンセーター', 'モノリシックサプレッサー', 'ライトウェイトサプレッサー'], ['バレル ', '.45コンパクト', '.45マッチグレード', '1911ストーカー'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'Cronen LP945ミニリフレックス', 'Solozeroサイトミニリフレックス', 'Glユニットミニリフレックスサイト'], ['トリガーアクション ', '軽量トリガー', '耐久トリガー', 'マッチグレードトリガー'], ['弾薬 ', '10ラウンドマガジン', '15ラウンドマガジン'], ['リアグリップ ', 'ラバーグリップテープ', 'ステッピング加工グリップテープ', '粒状グリップテープ'], ['PERK ', '高速近接', 'フランジブル弾：障害', 'リーコン', 'フルロード', 'FMJ', 'フランジブル弾：傷害', '稼ぎ屋', 'スライハンド', 'ヘビーヒッター']]
h_357 = [['.357'], ['マズル ', 'フラッシュガード', 'マズルブレーキ', 'コンペンセーター'], ['バレル ', '.357スナブノーズ', 'シルバーフィールド・オーディナンス.357', '.357ロング'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'エイムOPリフレックスサイト', 'コープコンバットホロサイト', 'Glユニットミニリフレックスサイト', 'Solozeroサイトミニリフレックス', 'スカウトコンバットサイト', 'APX5ホログラフィックサイト', 'バイパーリフレックスサイト', 'VLK3.0xサイト', 'Cronen LP945ミニリフレックス', 'モノクルリフレックスサイト', 'Cronen C480 Proサイト', 'Lockwoodハンドガンスコープ'], ['トリガーアクション ', '軽量トリガー', '耐久トリガー', 'マッチグレードトリガー'], ['弾薬 ', 'スネークショット'], ['リアグリップ ', '粒状グリップテープ', 'Lockwood.357カスタムストック', 'ステッピング加工グリップテープ', 'FSSレイダーストック', 'ラバーグリップテープ'], ['PERK ', '高速近接', 'フランジブル弾：障害', 'フルロード', 'スライハンド', 'フランジブル弾：傷害', '稼ぎ屋', 'リーコン', 'ヘビーヒッター', 'FMJ']]
m19 = [['M19'], ['マズル ', 'マズルブレーキ', 'フラッシュガード', 'モノリシックサプレッサー', 'ライトウェイトサプレッサー', 'コンペンセーター', 'オイル缶サプレッサー', 'タクティカルサプレッサー'], ['バレル ', 'XBK Lスーパー', 'XRK Vエクステンデッド', 'A9-16ライトウェイト'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'Cronen LP945ミニリフレックス', 'Solozeroサイトミニリフレックス', 'Glユニットミニリフレックスサイト'], ['トリガーアクション ', '軽量トリガー', '耐久トリガー', 'マッチグレードトリガー'], ['弾薬 ', '21ラウンドマガジン', '32ラウンドマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ラバーグリップテープ', 'ステッピング加工グリップテープ'], ['PERK ', '高速近接', 'フランジブル弾：障害', 'フルロード', 'FMJ', '稼ぎ屋', 'ヘビーヒッター', 'スライハンド', 'リーコン', 'フランジブル弾：傷害']]
h_50gs = [['.50 GS'], ['マズル ', 'フラッシュガード', 'マズルブレーキ', 'モノリシックサプレッサー', 'オイル缶サプレッサー', 'コンペンセーター', 'ライトウェイトサプレッサー', 'タクティカルサプレッサー'], ['バレル ', 'FORGE TACエクステンデッド', 'FORGE TACエンフォーサー'], ['レーザー ', '1mWレーザー', '5mWレーザー', 'タックレーザー'], ['サイト ', 'オペレーターリフレックスサイト', 'Cronen LP945ミニリフレックス', 'コープコンバットホロサイト', 'エイムOPリフレックスサイト', 'Solozeroサイトミニリフレックス', 'APX5ホログラフィックサイト', 'バイパーリフレックスサイト', 'スカウトコンバットサイト', 'Glユニットミニリフレックスサイト', 'VLK3.0xサイト', 'モノクルリフレックスサイト', 'Cronen C480 Proサイト'], ['トリガーアクション ', '軽量トリガー', '耐久トリガー', 'マッチグレードトリガー'], ['弾薬 ', '10ラウンドマガジン', '13ラウンドマガジン'], ['リアグリップ ', '粒状グリップテープ', 'ラバーグリップテープ', 'ステッピング加工グリップテープ'], ['PERK ', '高速近接', 'フランジブル弾：障害', 'フルロード', 'スライハンド', 'フランジブル弾：傷害', '稼ぎ屋', 'リーコン', 'ヘビーヒッター', 'FMJ']]






##loadout  ###########################################################################
main_l = [
[kilo141, fal, m4a1, fr556,oden,m13,fn_scar,ak47,ram_7],
[aug, p90, mp5, uzi ,pp19_bizon, mp7],
[model, r9_0_shotgun, s725, origin],
[pkm, sa87, m91, mg34, holger],
[ebr, mk2, kar98k],
[dragunov, hdr, ax_50, "Riot Shield"]
]

sub_l = [
[x16, h1911, h_357, m19, h_50gs],
["PILA", "STRELA-P", "JOKR", "RPG-7", "Combat Knife"]
]

park1_l = [
"ダブルタイム", "E.O.D.", "オーバーキル", "スカベンジャー", "コールドブラッド", "クイックフィックス"
]

park2_l = [
"リストック", "ハードライン", "ハイアラート", "ゴースト", "キルチェーン", "ポイントマン"
]

park3_l = [
"チェーンアップ", "アンプ", "シュラプネル", "バトルハーデン", "スポッター", "トラッカー"
]


lethal_l = [
"クレイモア", "フラグ", "モロトフ", "C4", "セムテックス", "投げナイフ", "センサーマイン",
"テルミット"
]

tactical_l = [
"スタン", "フラッシュ", "スモーク", "スナップショット", "心拍センサー", "ガス",
"スティム", "デコイ"
]

kill_s_l = [
["パーソナルレーダー", "シールドターレット"],
["カウンターUAV", "UAV", "ケアパッケージ"],
["クラスターストライク", "巡航ミサイル", "エアストライク"],
["歩兵戦闘機", "セントリーガン", "ウィールソン"],
["緊急救援物資", "V.T.O.L"],
["白リン弾", "ヘリガンナー"],
"サポートヘリ",
["ガンシップ", "アドバンスドUAV"],
"ジャガーノート"
]

field_u_l = [
"ミューニションボックス", "リーコンドローン", "デッドサイレンス", "ストッピングパワー弾",
"トロフィーシステム", "デプロイカバー", "戦術マーカー", "EMPドローン", "ウェポンドロップ"
]


########methods #######################################################################################
import random
def main_rand():
    main_category = random.choice( main_l )
    main_weapon = random.choice( main_category )
    if type( main_weapon ) == str:
        print_main_weapon = main_weapon

        return print_main_weapon, ""

    else:
        main_weapon_name = main_weapon.pop(0)
        print_main_weapon = main_weapon_name[0]

        main_attach_category =  random.sample( main_weapon, 5 )
        attachments = []
        for i in range( len( main_attach_category ) ):
            attach_category = main_attach_category[i].pop(0)
            main_attach_names = random.choice( main_attach_category[i] )
            attachments.append( "{0}:  {1}".format(attach_category,
                                                         main_attach_names))
        print_attachment = "\n".join(attachments)


        return print_main_weapon, print_attachment



def sub_rand():
    sub_category = random.choice( sub_l )
    sub_weapon = random.choice( sub_category )
    if type( sub_weapon ) == str:
        print_sub_weapon = sub_weapon

        return print_sub_weapon, ""

    else:
        sub_weapon_name = sub_weapon.pop(0)
        print_sub_weapon = sub_weapon_name[0]

        sub_attach_category =  random.sample( sub_weapon, 5 )
        attachments = []
        for i in range( len( sub_attach_category ) ):
            attach_category = sub_attach_category[i].pop(0)
            main_attach_names = random.choice( sub_attach_category[i] )
            attachments.append( "{0}:  {1}".format(attach_category,
                                                         main_attach_names))
        print_attachment = "\n".join(attachments)


        return print_sub_weapon, print_attachment



def park_lethal_tactical():
    park1 = random.choice( park1_l )
    park2 = random.choice( park2_l )
    park3 = random.choice( park3_l )

    lethal = random.choice( lethal_l )
    tactical = random.choice( tactical_l )

    return park1, park2, park3, lethal, tactical




def streak_upgrade():
    streaks = random.sample( kill_s_l, 3 )
    streak_list = []
    for s in streaks:
        if type(s) == str:
            streak_list.append( s )
        else:
            streak_list.append ( random.choice( s ) )
    streak = "\n".join( streak_list )

    #streak = "{0} {1} {2}".format( streak01, streak02, streak03 )

    upgrade= random.choice( field_u_l )

    return streak, upgrade

###################################################################################################




# インストールした discord.py を読み込む
import discord

# 自分のBotのアクセストークンに置き換えてください
TOKEN = 'NjYyMDEwMjgzMDQ0MjQxNDIz.XgzvXg.clgqw1RvdAMJEFEvUHpBOKBQjuY'

# 接続に必要なオブジェクトを生成
client = discord.Client()

# 起動時に動作する処理
@client.event
async def on_ready():
    # 起動したらターミナルにログイン通知が表示される
    print('ログインしました')

# メッセージ受信時に動作する処理
# 武器データ読み込み
@client.event
async def on_message(message):
    # メッセージ送信者がBotだった場合は無視する
    if message.author.bot:
        return
    # 「??rand」と発言したら「にゃーん」が返る処理
    if message.content == '?loadout':
        # メイン武器取得
        main = main_rand()
        main_name = main[0]
        main_attach = main[1]
        # サブ武器取得
        sub = sub_rand()
        sub_name = sub[0]
        sub_attach = sub[1]
        # パーク、装備取得
        plt = park_lethal_tactical()
        park1 = plt[0]
        park2 = plt[1]
        park3 = plt[2]
        lethal = plt[3]
        tac = plt[4]
        # ストリーク、フィールドアップグレード
        su = streak_upgrade()
        streak = su[0]
        field = su[1]
        await message.channel.send('?????????  main ?????????\n{0}\n\{1}\
                                   \n?????????  sub  ?????????\n{2}\n{3}\
                                   \n'.format(main_name, main_attach, sub_name, sub_attach)  )
                                   
        await message.channel.send('\n?????????  park  ?????????\
                                   \n{0}\n{1}\n{2}\
                                   \n?????????  lethal, tactical  ?????????\
                                   \n{3}\n{4}\
                                   \n?????????  kill_streak  ?????????\
                                   \n{5}\
                                   \n?????????  feild_upgrade  ?????????\
                                   \n{6}\
                                   \n'.format(park1, park2, park3, lethal, tac, streak, field) )

# Botの起動とDiscordサーバーへの接続
client.run(TOKEN)
