# -*- coding: utf-8 -*-
"""
Created on Sun Jan  5 03:18:21 2020

@author: LocoH31
"""

##loadout  ###########################################################################
main = [
[kilo141, fal, m4a1, fr556,oden,m13,fn_scar,ak47,ram_7],
[aug, p90, mp5, uzi ,pp19_bizon, mp7],
[model, r9_0_shotgun, s725, origin],
[pkm, sa87, m91, mg34, holger],
[ebr, mk2, kar98k],
[dragunov, hdr, ax_50, "Riot Shield"]
]

sub = [
[x16, h1911, h_357, m19, h_50gs],
["PILA", "STRELA-P", "JOKR", "RPG-7", "Combat Knife"]
]

park1 = [
"ダブルタイム", "E.O.D.", "オーバーキル", "スカベンジャー", "コールドブラッド", "クイックフィックス"
]

park2 = [
"リストック", "ハードライン", "ハイアラート", "ゴースト", "キルチェーン", "ポイントマン"
]

park3 = [
"チェーンアップ", "アンプ", "シュラプネル", "バトルハーデン", "スポッター", "トラッカー"
]


lethal = [
"クレイモア", "フラグ", "モロトフ", "C4", "セムテックス", "投げナイフ", "センサーマイン",
"テルミット"
]

tactical = [
"スタン", "フラッシュ", "スモーク", "スナップショット", "心拍センサー", "ガス",
"スティム", "デコイ"
]

kill_s = [
["パーソナルレーダー", "シールドターレット"],
["カウンターUAV", "UAV", "ケアパッケージ"],
["クラスターストライク", "巡航ミサイル", "エアストライク"],
["歩兵戦闘機", "セントリーガン", "ウィールソン"],
["緊急救援物資", "V.T.O.L"],
["白リン弾", "ヘリガンナー"],
"サポートヘリ",
["ガンシップ", "アドバンスドUAV"],
"ジャガーノート"
]

field_u = [
"ミューニションボックス", "リーコンドローン", "デッドサイレンス", "ストッピングパワー弾",
"トロフィーシステム", "デプロイカバー", "戦術マーカー", "EMPドローン", "ウェポンドロップ"
]